tutorials/incompressibleFluid/pipeCyclic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField
{
    type        coded;

    evaluate
    #{
        field = velocity(1, 0, 0) + (C ^ rate(2, 0, 0));
    #};
}

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type           functionalFixedValue;

        value
        {
            $internalField;
        }
    }

    outlet
    {
        type            pressureInletOutletVelocity;
    }

    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
